#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

module.team_project.github_team.team[0]: Refreshing state... [id=6696757]
data.github_user.florian: Reading...
module.repo-sbx-actions.github_repository.repository: Refreshing state... [id=sbx-actions]
module.team_sbx.github_team.team[0]: Refreshing state... [id=7033781]
data.github_user.andreas: Reading...
module.team_internal.github_team.team[0]: Refreshing state... [id=6696813]
module.repository_project.github_repository.repository: Refreshing state... [id=project]
module.repo2.github_repository.repository: Refreshing state... [id=test-repo-2]
module.team_test.github_team.team[0]: Refreshing state... [id=6696811]
module.repo1.github_repository.repository: Refreshing state... [id=test-repo-1]
data.github_user.caitlin: Reading...
data.github_user.chris: Reading...
data.github_user.jean_paul: Reading...
data.github_user.benoit: Reading...
data.github_user.meejah: Reading...
module.team_foo.github_team.team[0]: Refreshing state... [id=6696818]
module.repo2.github_team_repository.team_repository_by_slug["test"]: Refreshing state... [id=6696811:test-repo-2]
module.repository_project.github_team_repository.team_repository_by_slug["project"]: Refreshing state... [id=6696757:project]
data.github_user.andreas: Read complete after 2s [id=563314]
module.repo1.github_team_repository.team_repository_by_slug["foo"]: Refreshing state... [id=6696818:test-repo-1]
data.github_user.florian: Read complete after 2s [id=454605]
module.repo1.github_repository_collaborator.collaborator["hacklschorsch"]: Refreshing state... [id=test-repo-1:hacklschorsch]
data.github_user.caitlin: Read complete after 3s [id=63412287]
data.github_user.chris: Read complete after 3s [id=882430]
data.github_user.jean_paul: Read complete after 3s [id=254565]
module.team_project.github_team_membership.team_membership["exarkun"]: Refreshing state... [id=6696757:exarkun]
module.team_foo.github_team_membership.team_membership["crwood"]: Refreshing state... [id=6696818:crwood]
module.team_foo.github_team_membership.team_membership["exarkun"]: Refreshing state... [id=6696818:exarkun]
module.team_project.github_team_membership.team_membership["wuan"]: Refreshing state... [id=6696757:wuan]
data.github_user.benoit: Read complete after 2s [id=7703888]
module.repo-sbx-actions.github_repository_collaborator.collaborator["btlogy"]: Refreshing state... [id=sbx-actions:btlogy]
module.team_sbx.github_team_membership.team_membership["btlogy"]: Refreshing state... [id=7033781:btlogy]
module.team_sbx.github_team_membership.team_membership["wuan"]: Refreshing state... [id=7033781:wuan]
data.github_user.meejah: Read complete after 2s [id=145599]
module.team_test.github_team_membership.team_membership["wuan"]: Refreshing state... [id=6696811:wuan]
module.team_test.github_team_membership.team_membership["exarkun"]: Refreshing state... [id=6696811:exarkun]
module.team_test.github_team_membership.team_membership["meejah"]: Refreshing state... [id=6696811:meejah]
module.team_test.github_team_membership.team_membership["c-chroniko"]: Refreshing state... [id=6696811:c-chroniko]
module.team_internal.github_team_membership.team_membership["btlogy"]: Refreshing state... [id=6696813:btlogy]
module.team_internal.github_team_membership.team_membership["wuan"]: Refreshing state... [id=6696813:wuan]
module.team_internal.github_team_membership.team_membership["exarkun"]: Refreshing state... [id=6696813:exarkun]
module.team_internal.github_team_membership.team_membership["meejah"]: Refreshing state... [id=6696813:meejah]
module.repo1.github_branch_protection_v3.branch_protection[0]: Refreshing state... [id=test-repo-1:main]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.team_sbx.github_team.team[0] has changed
  ~ resource "github_team" "team" {
      ~ etag                      = "W/\"02c8ee6e99df5154f5ee7adbe9827e58405d0827ba802be602ff211a34448e21\"" -> "W/\"819a714c8e2d623eb22ce04e4860887b83e1aa6c204d38962265f1a6a5f8fc60\""
        id                        = "7033781"
      ~ members_count             = 0 -> 2
        name                      = "sbx"
        # (4 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.repo-sbx-actions.github_actions_secret.repository_secret["CID_PRIVATE_KEY"] will be created
  + resource "github_actions_secret" "repository_secret" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "sbx-actions"
      + secret_name     = "CID_PRIVATE_KEY"
      + updated_at      = (known after apply)
    }

  # module.repo-sbx-actions.github_branch_protection_v3.branch_protection[0] will be created
  + resource "github_branch_protection_v3" "branch_protection" {
      + branch                          = "main"
      + enforce_admins                  = true
      + etag                            = (known after apply)
      + id                              = (known after apply)
      + repository                      = "sbx-actions"
      + require_conversation_resolution = true
      + require_signed_commits          = true

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + required_approving_review_count = 1
        }
    }

  # module.repo-sbx-actions.github_team_repository.team_repository_by_slug["sbx"] will be created
  + resource "github_team_repository" "team_repository_by_slug" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "push"
      + repository = "sbx-actions"
      + team_id    = "sbx"
    }

Plan: 3 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @btlogy, Action: `pull_request`, Working Directory: ``, Workflow: `GitHub config CI`*